// Инструкции ,выражения ,операторы

// Инструкции

инструкция1;
инструкция2;
инструкция3;
var state;

// Выражения

state = 5+2; // инструкции state присвоили выражение

// Операторы

	// арифметические

	var ar =	'
			+
			-
			*
			/
			5%2 
			= 
			++i
			--i
		'

		var i = 2,
			b = 2;

		// Различие между префиксным и постфиксным инкрементом	

		console.log(++i); // 3
		console.log(b++); // 2
		console.log(b) // 2


	// сравнения

	a < b 
	a > b 
	a >= b
	a <= b

	// Плохая практика
	a == b
	a != b  

	// Хорошая практика
	a === b
	a !== b
			// Возвращают true или false

	// условные
	// логические 
	// побитовые - используются редко

